# Setup

In [1]:
!python --version

Python 3.9.5

In [2]:
!pip install helpsk --upgrade

Requirement already satisfied: helpsk in /Users/shanekercheval/opt/anaconda3/envs/python-examples/lib/python3.9/site-packages (0.0.7)

In [3]:
import pandas as pd
import numpy as np
from helpsk import string

# `is` vs `==`

`==` is an equality test. It checks whether the right hand side and the left hand side are equal objects (according to their __eq__ or __cmp__ methods.)

is is an identity test. It checks whether the right hand side and the left hand side are the very same object. No methodcalls are done, objects can't influence the is operation.

You use `is` (and `is not`) for `singletons`, like `None`, where you don't care about objects that might want to pretend to be None or where you want to protect against objects breaking when being compared against None.

# List & DataFrame Equality

In [4]:
[1, 2, 3] == [1, 2, 3]

True

In [5]:
[1, 2, 3] == [1, 2, 3.00001]

False

In [6]:
['a', 'b', 'c'] == ['a', 'b', 'c']

True

In [7]:
['a', 'b', None] == ['a', 'b', None]

True

In [8]:
['a', 'b', 'c'] == ['a', 'b', None]

False

In [9]:
pd.DataFrame([[1, 2], [2, 3]]).equals(pd.DataFrame([[1, 2], [2, 3]]))

True

In [10]:
pd.DataFrame([[1, 2], [2, 3]]).equals(pd.DataFrame([[1, 2], [2, 3.001]]))

False

In [11]:
pd.DataFrame([[1, None], [2, 3.001]]).equals(pd.DataFrame([[1, None], [2, 3.001]]))

True

# Checking for Empty Containers

In [12]:
a = []

len(a) == 0  # not Pythonic

True

In [13]:
not a  # Pythonic

True

In [14]:
if len(a) == 0:
    print('Not Pythonic')

if not a:
    print('Pythonic')

Not Pythonic
Pythonic

In [15]:
a = ['a']

if len(a) != 0:
    print('Not Pythonic')

if a:
    print('Pythonic')

Not Pythonic
Pythonic

# Multi-lines

In [16]:
# not Pythonic
a = 1 + \
    2
print(a)

a = (1 +  # Pythonic
     2)
print(a)

3
3

# Strings

## Formatting (F-Strings)

options: https://docs.python.org/3/library/string.html

In [202]:
my_variable = "Some value"
another_variable = 987654321.123456789

In [204]:
f"The value of '{my_variable:<20}' is {another_variable}. {{Also, here's how to espace the bracks.}}"

"The value of 'Some value          ' is 987654321.1234568. {Also, here's how to espace the bracks.}"

In [221]:
f"The value of '{my_variable}' is {another_variable:,.5f}. {{Also, here's how to espace the bracks.}}"

"The value of 'Some value' is 987,654,321.12346. {Also, here's how to espace the bracks.}"

# Classes

## Private vs Protected

In [17]:
class Example:
    def __init__(self):
        self.__private_variable = 'private'
        self._protected_variable = 'protected'
    
    def instance_method(self):
        return 'instance method ' + self.__private_variable + self._protected_variable
    
    @staticmethod
    def static_method(x):
        return 'static method ' + x
    
    @classmethod
    def class_method(cls, x):
        return 'class method ' + x

In [18]:
ex = Example()
ex._protected_variable

'protected'

In [19]:
try:
  print(ex.__private_variable)
except Exception as e:
  print(e)

'Example' object has no attribute '__private_variable'

In [20]:
ex._Example__private_variable

'private'

In [21]:
ex.instance_method()

'instance method privateprotected'

In [22]:
ex.static_method('a')  # not sure how this is useful

'static method a'

In [23]:
Example.class_method('a')  # no instance

'class method a'

## Getters / Setters

In [24]:
class ExampleClass:

    def __init__(self, my_variable=0):
        self._my_variable = my_variable

    @property
    def my_variable(self):
        """I'm the 'my_variable' property."""
        print("getter of my_variable called")
        return self._my_variable

    @my_variable.setter
    def my_variable(self, value):
        print("setter of my_variable called")
        self._my_variable = value

In [25]:
example = ExampleClass()
example.my_variable == 0

getter of my_variable called

True

In [26]:
example.my_variable = 0

setter of my_variable called

# Pandas

In [27]:
import numpy as np
import pandas as pd

dates = pd.date_range("20210809", periods=6)
df = pd.DataFrame(np.random.randn(6, 4),
                  index=dates,
                  columns=list("ABCD"))

In [28]:
dates

DatetimeIndex(['2021-08-09', '2021-08-10', '2021-08-11', '2021-08-12',
               '2021-08-13', '2021-08-14'],
              dtype='datetime64[ns]', freq='D')

In [29]:
df

                   A         B         C         D
2021-08-09 -0.172463  0.837738 -0.363259 -0.178903
2021-08-10  0.337003  0.312294  1.178289  1.859434
2021-08-11 -0.338736 -0.350792  0.628887 -0.671186
2021-08-12  2.031639  0.798231  0.807028 -1.399698
2021-08-13 -0.183317 -1.488023 -0.029879  1.134928
2021-08-14 -0.206648 -0.766554  0.242564 -0.755466

## Copy by Reference

In [30]:
df_2 = df

In [31]:
df.iat[0, 0] = np.nan

In [32]:
df.iloc[0, :]

A         NaN
B    0.837738
C   -0.363259
D   -0.178903
Name: 2021-08-09 00:00:00, dtype: float64

In [33]:
df_2.iloc[0, :]

A         NaN
B    0.837738
C   -0.363259
D   -0.178903
Name: 2021-08-09 00:00:00, dtype: float64

### Use `.copy()` for deep copy

In [34]:
df_2 = df.copy()

In [35]:
df.iat[0, 1] = np.nan

In [36]:
df.iloc[0, :]

A         NaN
B         NaN
C   -0.363259
D   -0.178903
Name: 2021-08-09 00:00:00, dtype: float64

In [37]:
df_2.iloc[0, :]

A         NaN
B    0.837738
C   -0.363259
D   -0.178903
Name: 2021-08-09 00:00:00, dtype: float64

## Selection

In [38]:
df.A

2021-08-09         NaN
2021-08-10    0.337003
2021-08-11   -0.338736
2021-08-12    2.031639
2021-08-13   -0.183317
2021-08-14   -0.206648
Freq: D, Name: A, dtype: float64

In [39]:
df['A']  # all rows of single column

2021-08-09         NaN
2021-08-10    0.337003
2021-08-11   -0.338736
2021-08-12    2.031639
2021-08-13   -0.183317
2021-08-14   -0.206648
Freq: D, Name: A, dtype: float64

In [40]:
df[0:1]  # slices rows; excludes last index

             A   B         C         D
2021-08-09 NaN NaN -0.363259 -0.178903

In [41]:
df[['A']]

                   A
2021-08-09       NaN
2021-08-10  0.337003
2021-08-11 -0.338736
2021-08-12  2.031639
2021-08-13 -0.183317
2021-08-14 -0.206648

If passing a single value to `.loc`, a Series is returned; if passing a list to `.loc` a DataFrame is returned

In [42]:
df.loc[pd.to_datetime('2021-08-09')]

A         NaN
B         NaN
C   -0.363259
D   -0.178903
Name: 2021-08-09 00:00:00, dtype: float64

In [43]:
df.loc[[pd.to_datetime('2021-08-09')]]

             A   B         C         D
2021-08-09 NaN NaN -0.363259 -0.178903

In [44]:
df.loc[[pd.to_datetime('2021-08-09'), pd.to_datetime('2021-08-10')]]

                   A         B         C         D
2021-08-09       NaN       NaN -0.363259 -0.178903
2021-08-10  0.337003  0.312294  1.178289  1.859434

### `at` vs `loc`

- `df.at` is faster
- `df.at` can only access a single value at a time.
- `df.loc` can select multiple rows and/or columns.


https://stackoverflow.com/questions/37216485/pandas-at-versus-loc

## Get

method that allows you to index on a collection and return default value if the index is out of range

### Dictionary

In [45]:
{'a': 1, 'b': 2}.get('c') is None

True

In [46]:
{'a': 1, 'b': 2}.get('c', 0)

0

In [47]:
# ['c'] raises KeyError
from helpsk import validation
validation.raises_exception(lambda: {'a': 1, 'b': 2}['c'], KeyError)

True

### Series

In [48]:
dates[0]

Timestamp('2021-08-09 00:00:00', freq='D')

In [49]:
df.D.get(dates[0])

-0.1789031516091203

In [50]:
df.D.get(pd.date_range('2021-01-01', periods=1)[0]) is None

True

In [51]:
df.D.get(pd.date_range('2021-01-01', periods=1)[0], np.NaN)

nan

## Vectorized Operations - Automatic Alignment

A key difference between Series and ndarray is that operations between Series automatically align the data based on label. Thus, you can write computations without giving consideration to whether the Series involved have the same labels.

https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html#vectorized-operations-and-label-alignment-with-series

In [52]:
s1 = pd.Series([1, 2, 3, 4, 5], index=['A', 'B', 'C', 'D', 'E'])
s2 = pd.Series([10, 20, 30, 40, 50], index=['A', 'B', 'C', 'D', 'E'])

s1 + s2

A    11
B    22
C    33
D    44
E    55
dtype: int64

In [53]:
print(s1.iloc[[4, 3, 2, 1, 0]])
s1.iloc[[4, 3, 2, 1, 0]] + s2

E    5
D    4
C    3
B    2
A    1
dtype: int64

A    11
B    22
C    33
D    44
E    55
dtype: int64

The result of an operation between unaligned Series will have the union of the indexes involved. If a label is not found in one Series or the other, the result will be marked as missing NaN.

In [54]:
s1.iloc[[2, 3, 4]] + s2.iloc[[0, 1, 2, 3]]

A     NaN
B     NaN
C    33.0
D    44.0
E     NaN
dtype: float64

## Applying Functions

https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#function-application

### Tablewise function application - Chaining Function Calls with `pipe()`

In [55]:
df_p = pd.DataFrame({"city_and_code": ["Chicago, IL", "Seattle, WA"]})
df_p

  city_and_code
0   Chicago, IL
1   Seattle, WA

In [56]:
df_p["city_and_code"].str.split(",")

0    [Chicago,  IL]
1    [Seattle,  WA]
Name: city_and_code, dtype: object

In [57]:
df_p["city_and_code"].str.split(",").str.get(1)

0     IL
1     WA
Name: city_and_code, dtype: object

In [58]:
def extract_city_name(df):
    """
    Chicago, IL -> Chicago for city_name column
    """
    df["city_name"] = df["city_and_code"].str.split(",").str.get(0)
    return df

def add_country_name(df, country_name=None):
    """
    Chicago -> Chicago-US for city_name column
    """
    col = "city_name"
    df["city_and_country"] = df[col] + country_name
    return df

In [59]:
df_p.pipe(extract_city_name).pipe(add_country_name, country_name="US")

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS
1   Seattle, WA   Seattle        SeattleUS

Python is pass by reference, so, unlike R, the DataFrame changes without having to make final assignment back into `df_p`. Instaed of returning the DataFrame object we are returning a pointer do the object.

In [60]:
df_p

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS
1   Seattle, WA   Seattle        SeattleUS

### Row/Column wise function application

https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#tablewise-function-application

Arbitrary functions can be applied along the axes of a DataFrame using the apply() method, which, like the descriptive statistics methods, takes an optional axis argument:

In [61]:
# axis 0 indicates column-wise operations (across the rows, for each column)
df.apply(lambda x: x.mean(), axis=0)

A    0.327988
B   -0.298969
C    0.410605
D   -0.001815
dtype: float64

In [62]:
# axis 1 indicates row-wise operations (across the columns, for each row)
df.apply(lambda x: x.mean(), axis=1)

2021-08-09   -0.271081
2021-08-10    0.921755
2021-08-11   -0.182957
2021-08-12    0.559300
2021-08-13   -0.141573
2021-08-14   -0.371526
Freq: D, dtype: float64

## Pandas Aggregations

In [63]:
import pandas as pd
import numpy as np

data = pd.DataFrame({
    'col1':['a','a','a','a','a','b','b','b','b','b'],
    'col2':[10, 20, 30, 40, 50, 60, 70, 80, 90, 100],
    'col3':[100, 200, 300, 400, 500, 600, 700, 800, 900, 1000],
})

In [64]:
data

  col1  col2  col3
0    a    10   100
1    a    20   200
2    a    30   300
3    a    40   400
4    a    50   500
5    b    60   600
6    b    70   700
7    b    80   800
8    b    90   900
9    b   100  1000

### Use `.agg()` for simple functions on single columns

Meaning, there isn't any interaction between columns. (i.e. can't do `col2 + col3`)

In [65]:
data.groupby('col1').agg({'col2': [min, max], 'col3': [min, np.median, max]})

     col2      col3
      min  max  min median   max
col1
a      10   50  100  300.0   500
b      60  100  600  800.0  1000

### Use .apply() to create interaction among multiple columns

https://stackoverflow.com/questions/10951341/pandas-dataframe-aggregate-function-using-multiple-columns

In [66]:
data

  col1  col2  col3
0    a    10   100
1    a    20   200
2    a    30   300
3    a    40   400
4    a    50   500
5    b    60   600
6    b    70   700
7    b    80   800
8    b    90   900
9    b   100  1000

R Equivalent (although not quite because we don't get to name the column; returning column is `col1`, not `result_a`):

```
data %>%
    group_by(col1) %>%
    summarise(result_a = sum(col2 * col3))
```

In [67]:
grouped = data.groupby('col1')

def my_function(group):
    col2 = group['col2']
    col3 = group['col3']
    return (col2 * col3).sum()

result = grouped.apply(my_function)
result

col1
a     55000
b    330000
dtype: int64

In [68]:
result['b']

330000

---

Let's remove the .sum() and just multiply across groups, to see what the result is.

In [69]:
grouped = data.groupby('col1')

def my_function(group):
    col2 = group['col2']
    col3 = group['col3']
    return (col2 * col3)#.sum()

result = grouped.apply(my_function)
result

col1
a     0      1000
      1      4000
      2      9000
      3     16000
      4     25000
b     5     36000
      6     49000
      7     64000
      8     81000
      9    100000
dtype: int64

---

### `group_by(...) %>% summarise(...)`

The following examples shows the equivalent of R's `group_by(...) %>% summarise(...)`

https://stackoverflow.com/questions/14529838/apply-multiple-functions-to-multiple-groupby-columns

Unlike the last examples, we can A) name the columns and B) interact the grouped columns.

In [70]:
data

  col1  col2  col3
0    a    10   100
1    a    20   200
2    a    30   300
3    a    40   400
4    a    50   500
5    b    60   600
6    b    70   700
7    b    80   800
8    b    90   900
9    b   100  1000

In [71]:
def f(x):
    d = {}
    d['result_a'] = (x['col2'] * x['col3']).sum()
    d['result_b'] = x['col2'].sum() * x['col3'].sum()
    d['result_c'] = (x['col2'] + x['col3']).values
    d['count'] = x.shape[0]
    d['col2_max'] = x['col2'].max()
    d['col3_max'] = x['col3'].max()
    return pd.Series(d)

data.groupby('col1').apply(f)

,result_a,result_b,result_c,count,col2_max,col3_max
col1,,,,,,
a,55000,225000,"[110, 220, 330, 440, 550]",5,50,500
b,330000,1600000,"[660, 770, 880, 990, 1100]",5,100,1000

which is equivalent to:

```
data %>%
    group_by(col1) %>%
    summarise(result_a = sum(col2 * col3),
              result_b = sum(col2) * sum(col3),
              ...)
```

### `group_by(...) %>% mutate(...)`

https://gist.github.com/conormm/fd8b1980c28dd21cfaf6975c86c74d07


```
df %>% group_by(group) %>% mutate(mean_var1 = mean(var1))  # R
```

In [72]:
df = pd.DataFrame(data = {'group': ['A', 'A', 'B', 'B'],
                          'var1': [1, 2, 3, 4],
                          'var2': [40, 30, 20, 10]})
df

  group  var1  var2
0     A     1    40
1     A     2    30
2     B     3    20
3     B     4    10

In [73]:
df.assign(mean_var1 = lambda x: x.groupby('group')['var1'].transform('mean'))

  group  var1  var2  mean_var1
0     A     1    40        1.5
1     A     2    30        1.5
2     B     3    20        3.5
3     B     4    10        3.5

In [74]:
# here is what the inside of the lambda function above gives without .assign()
df.groupby('group')['var1'].transform('mean')

0    1.5
1    1.5
2    3.5
3    3.5
Name: var1, dtype: float64

TODO: show more advanced example of above with column interactions

In [75]:
df.groupby('group').transform('mean')

   var1  var2
0   1.5  35.0
1   1.5  35.0
2   3.5  15.0
3   3.5  15.0

---

In [76]:
df.var1.rank(ascending=False)

0    4.0
1    3.0
2    2.0
3    1.0
Name: var1, dtype: float64

In [77]:
df.groupby('group')['var1'].transform(lambda x: x.rank(ascending=False))

0    2.0
1    1.0
2    2.0
3    1.0
Name: var1, dtype: float64

In [78]:


df.groupby('group').transform(lambda x: x.rank(ascending=False))

   var1  var2
0   2.0   1.0
1   1.0   2.0
2   2.0   1.0
3   1.0   2.0

### `pivot_wider()`

#### via `pivot()`

https://stackoverflow.com/questions/40229444/trouble-pivoting-in-pandas-spread-in-r

In [79]:
df = pd.DataFrame({'site_id': {0: 'a', 1: 'a', 2: 'b', 3: 'b', 4: 'c', 5: 'c',6: 'a', 7: 'a', 8: 'b', 9: 'b', 10: 'c', 11: 'c'},
                   'dt': {0: 1, 1: 1, 2: 1, 3: 1, 4: 1, 5: 1,6: 2, 7: 2, 8: 2, 9: 2, 10: 2, 11: 2},
                   'eu': {0: 'FGE', 1: 'WSH', 2: 'FGE', 3: 'WSH', 4: 'FGE', 5: 'WSH',6: 'FGE', 7: 'WSH', 8: 'FGE', 9: 'WSH', 10: 'FGE', 11: 'WSH'},
                   'kw': {0: '8', 1: '5', 2: '3', 3: '7', 4: '1', 5: '5',6: '2', 7: '3', 8: '5', 9: '7', 10: '2', 11: '5'}})
df

   site_id  dt   eu kw
0        a   1  FGE  8
1        a   1  WSH  5
2        b   1  FGE  3
3        b   1  WSH  7
4        c   1  FGE  1
5        c   1  WSH  5
6        a   2  FGE  2
7        a   2  WSH  3
8        b   2  FGE  5
9        b   2  WSH  7
10       c   2  FGE  2
11       c   2  WSH  5

In [80]:
# notice `dt` is first so it is the first level index
df.pivot(index = ['dt', 'site_id'], values = 'kw', columns = 'eu')

eu         FGE WSH
dt site_id
1  a         8   5
   b         3   7
   c         1   5
2  a         2   3
   b         5   7
   c         2   5

---

#### via `set_index()` & 'unstack()`

In [81]:
df.set_index(['dt','site_id','eu']).unstack('eu')

            kw
eu         FGE WSH
dt site_id
1  a         8   5
   b         3   7
   c         1   5
2  a         2   3
   b         5   7
   c         2   5

---

equivalent to R's `pivot_longer(-site_id)`

In [82]:
df.set_index(['dt','site_id','eu']).unstack('site_id')

        kw
site_id  a  b  c
dt eu
1  FGE   8  3  1
   WSH   5  7  5
2  FGE   2  5  2
   WSH   3  7  5

---

#### from wide to long and back

In [83]:
df_wider = df.set_index(['dt','site_id','eu']).unstack('site_id')
df_wider

        kw
site_id  a  b  c
dt eu
1  FGE   8  3  1
   WSH   5  7  5
2  FGE   2  5  2
   WSH   3  7  5

In [84]:
# back to longer
df_wider.stack()

               kw
dt eu  site_id
1  FGE a        8
       b        3
       c        1
   WSH a        5
       b        7
       c        5
2  FGE a        2
       b        5
       c        2
   WSH a        3
       b        7
       c        5

In [85]:
# multi-index select
df_wider.loc[:, ['kw']]

        kw
site_id  a  b  c
dt eu
1  FGE   8  3  1
   WSH   5  7  5
2  FGE   2  5  2
   WSH   3  7  5

In [86]:
# multi-index select; pass tuple
df_wider.loc[([1, 2], 'FGE'), ('kw', ['a', 'c'])]

        kw
site_id  a  c
dt eu
1  FGE   8  1
2  FGE   2  2

### `pivot_longer()`

#### `melt()`

In [87]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [88]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

#### `wide_to_long()`

Another way to transform is to use the wide_to_long() panel data convenience function. It is less flexible than melt(), but more user-friendly.

https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html

> With stubnames [‘A’, ‘B’], this **function expects to find one or more group of columns with format A-suffix1, A-suffix2,…, B-suffix1, B-suffix2,…** You specify what you want to call this suffix in the resulting long format with j (for example j=’year’)

In [89]:
df = pd.DataFrame({"A1970" : {0 : "a", 1 : "b", 2 : "c"},
                   "A1980" : {0 : "d", 1 : "e", 2 : "f"},
                   "B1970" : {0 : 2.5, 1 : 1.2, 2 : .7},
                   "B1980" : {0 : 3.2, 1 : 1.3, 2 : .1},
                   "X"     : dict(zip(range(3), np.random.randn(3)))
                  })
df["id"] = df.index

In [90]:
df

  A1970 A1980  B1970  B1980         X  id
0     a     d    2.5    3.2 -0.010910   0
1     b     e    1.2    1.3 -0.325152   1
2     c     f    0.7    0.1 -0.791412   2

In [91]:
pd.wide_to_long(df, ["A", "B"], i="id", j="year")

                X  A    B
id year
0  1970 -0.010910  a  2.5
1  1970 -0.325152  b  1.2
2  1970 -0.791412  c  0.7
0  1980 -0.010910  d  3.2
1  1980 -0.325152  e  1.3
2  1980 -0.791412  f  0.1

## Misc

### Series.str

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses regular expressions by default (and in some cases always uses them).

https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html

In [92]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [93]:
s.str.capitalize()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    Caba
7     Dog
8     Cat
dtype: object

### Recipes

#### Get Top N Rows for Each Group

In [94]:
df = pd.DataFrame({'site_id': {0: 'a', 1: 'a', 2: 'b', 3: 'b', 4: 'c', 5: 'c',6: 'a', 7: 'a', 8: 'b', 9: 'b', 10: 'c', 11: 'c'},
                   'dt': {0: 1, 1: 1, 2: 1, 3: 1, 4: 1, 5: 1,6: 2, 7: 2, 8: 2, 9: 2, 10: 2, 11: 2},
                   'eu': {0: 'FGE', 1: 'WSH', 2: 'FGE', 3: 'WSH', 4: 'FGE', 5: 'WSH',6: 'FGE', 7: 'WSH', 8: 'FGE', 9: 'WSH', 10: 'FGE', 11: 'WSH'},
                   'kw': {0: '8', 1: '5', 2: '3', 3: '7', 4: '1', 5: '5',6: '2', 7: '3', 8: '5', 9: '7', 10: '2', 11: '5'}})
df = df.sort_values(by=['site_id', 'kw'])

In [95]:
df

   site_id  dt   eu kw
6        a   2  FGE  2
7        a   2  WSH  3
1        a   1  WSH  5
0        a   1  FGE  8
2        b   1  FGE  3
8        b   2  FGE  5
3        b   1  WSH  7
9        b   2  WSH  7
4        c   1  FGE  1
10       c   2  FGE  2
5        c   1  WSH  5
11       c   2  WSH  5

In [96]:
def top_n(df, n, column):
    return df.sort_values(by=column)[-n:]

top_n(df, n=2, column='kw')

  site_id  dt   eu kw
9       b   2  WSH  7
0       a   1  FGE  8

In [97]:
df.groupby('site_id').apply(top_n, n=2, column='kw')

           site_id  dt   eu kw
site_id
a       1        a   1  WSH  5
        0        a   1  FGE  8
b       3        b   1  WSH  7
        9        b   2  WSH  7
c       5        c   1  WSH  5
        11       c   2  WSH  5

## Performance

Accelerated operations

https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#accelerated-operations


pandas has support for accelerating certain types of binary numerical and boolean operations using the numexpr library and the bottleneck libraries.

These libraries are especially useful when dealing with large data sets, and provide large speedups. numexpr uses smart chunking, caching, and multiple cores. bottleneck is a set of specialized cython routines that are especially fast when dealing with arrays that have nans.

Here is a sample (using 100 column x 100,000 row DataFrames):

Operation
0.11.0 (ms)
Prior Version (ms)
Ratio to Prior
df1 > df2
13.32
125.35
0.1063
df1 * df2
21.71
36.63
0.5928
df1 + df2
22.04
36.50
0.6039

**You are highly encouraged to install both libraries**. See the section Recommended Dependencies for more installation info.

These are both enabled to be used by default, you can control this by setting the options:

```
pd.set_option("compute.use_bottleneck", False)
pd.set_option("compute.use_numexpr", False)
```

# Dates & Times

## `parse()`

In [98]:
from dateutil.parser import parse
parse('2021-08-14')

datetime.datetime(2021, 8, 14, 0, 0)

In [99]:
parse('2021-08-14 23:59:58')

datetime.datetime(2021, 8, 14, 23, 59, 58)

In [100]:
dates = [parse('2021-08-14'), parse('2021-08-15'), parse('2021-08-16'), parse('2021-08-16'),
         parse('2021-09-01'), parse('2022-01-01')]
dates

[datetime.datetime(2021, 8, 14, 0, 0),
 datetime.datetime(2021, 8, 15, 0, 0),
 datetime.datetime(2021, 8, 16, 0, 0),
 datetime.datetime(2021, 8, 16, 0, 0),
 datetime.datetime(2021, 9, 1, 0, 0),
 datetime.datetime(2022, 1, 1, 0, 0)]

In [101]:
df = pd.DataFrame({'value': [1, 2, 3, 3.1, 4, 5]}, index=dates)
df

            value
2021-08-14    1.0
2021-08-15    2.0
2021-08-16    3.0
2021-08-16    3.1
2021-09-01    4.0
2022-01-01    5.0

In [102]:
df.index.is_unique

False

In [103]:
df.loc['2021-08-15']

value    2.0
Name: 2021-08-15 00:00:00, dtype: float64

In [104]:
df.loc['20210815']

value    2.0
Name: 2021-08-15 00:00:00, dtype: float64

In [105]:
df.loc[dates[1]]

value    2.0
Name: 2021-08-15 00:00:00, dtype: float64

In [106]:
df.loc['2021']

            value
2021-08-14    1.0
2021-08-15    2.0
2021-08-16    3.0
2021-08-16    3.1
2021-09-01    4.0

In [107]:
df.get('2020')

In [108]:
df.get('2021')

/Users/shanekercheval/opt/anaconda3/envs/python-examples/lib/python3.9/site-packages/pandas/core/generic.py:3996: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  return self[key]

            value
2021-08-14    1.0
2021-08-15    2.0
2021-08-16    3.0
2021-08-16    3.1
2021-09-01    4.0

In [109]:
df.get('2021-08')

/Users/shanekercheval/opt/anaconda3/envs/python-examples/lib/python3.9/site-packages/pandas/core/generic.py:3996: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  return self[key]

            value
2021-08-14    1.0
2021-08-15    2.0
2021-08-16    3.0
2021-08-16    3.1

In [110]:
df.get('2022')

/Users/shanekercheval/opt/anaconda3/envs/python-examples/lib/python3.9/site-packages/pandas/core/generic.py:3996: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  return self[key]

            value
2022-01-01    5.0

In [111]:
df.loc['2021-08-16']

            value
2021-08-16    3.0
2021-08-16    3.1

In [112]:
df.get('2023')

In [113]:
# if ordered chronologically, you can slice with timestamp range
df['2021-08': '2021-09']

            value
2021-08-14    1.0
2021-08-15    2.0
2021-08-16    3.0
2021-08-16    3.1
2021-09-01    4.0

In [114]:
df.truncate(after='2021-09')

            value
2021-08-14    1.0
2021-08-15    2.0
2021-08-16    3.0
2021-08-16    3.1
2021-09-01    4.0

In [115]:
df.truncate(before='2021-09')

            value
2021-09-01    4.0
2022-01-01    5.0

In [116]:
df.groupby(level=0).count()

            value
2021-08-14      1
2021-08-15      1
2021-08-16      2
2021-09-01      1
2022-01-01      1

## date_range()

In [159]:
pd.date_range('2021-02', '2022-01-31')

DatetimeIndex(['2021-02-01', '2021-02-02', '2021-02-03', '2021-02-04',
               '2021-02-05', '2021-02-06', '2021-02-07', '2021-02-08',
               '2021-02-09', '2021-02-10',
               ...
               '2022-01-22', '2022-01-23', '2022-01-24', '2022-01-25',
               '2022-01-26', '2022-01-27', '2022-01-28', '2022-01-29',
               '2022-01-30', '2022-01-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [118]:
# returns the first day of the quarter between the range provided
pd.date_range('2021-02', '2022-01-31', freq='QS-JAN')

DatetimeIndex(['2021-04-01', '2021-07-01', '2021-10-01', '2022-01-01'], dtype='datetime64[ns]', freq='QS-JAN')

In [119]:
# returns the first *business* day of the quarter between the range provided
# Jan 1st 2022 falls on a saturday, the first business day is Monday the 3rd
pd.date_range('2021-02', '2022-01-31', freq='BQS-JAN')

DatetimeIndex(['2021-04-01', '2021-07-01', '2021-10-01', '2022-01-03'], dtype='datetime64[ns]', freq='BQS-JAN')

In [120]:
# returns the first day of the fiscal quarter (first quarter of the year is FEB) 
# between the range provided
pd.date_range('2021-02', '2022-01-31', freq='QS-FEB')

DatetimeIndex(['2021-02-01', '2021-05-01', '2021-08-01', '2021-11-01'], dtype='datetime64[ns]', freq='QS-FEB')

In [121]:
# returns the first *business* day of the fiscal quarter (first quarter of the year is FEB) 
# between the range provided
pd.date_range('2021-02', '2022-01-31', freq='BQS-FEB')

DatetimeIndex(['2021-02-01', '2021-05-03', '2021-08-02', '2021-11-01'], dtype='datetime64[ns]', freq='BQS-FEB')

## Offsets e.g. `MonthEnd()`

In [122]:
# M = Month End
pd.date_range('2021-02', '2021-05', freq='M')

DatetimeIndex(['2021-02-28', '2021-03-31', '2021-04-30'], dtype='datetime64[ns]', freq='M')

In [123]:
# MS = Month Start
pd.date_range('2021-02', '2021-05', freq='MS')

DatetimeIndex(['2021-02-01', '2021-03-01', '2021-04-01', '2021-05-01'], dtype='datetime64[ns]', freq='MS')

---

In [124]:
from pandas.tseries.offsets import Day, MonthBegin, MonthEnd, QuarterBegin, QuarterEnd

In [125]:
pd.date_range('2021-02', '2021-05', freq='M')

DatetimeIndex(['2021-02-28', '2021-03-31', '2021-04-30'], dtype='datetime64[ns]', freq='M')

In [126]:
# i would have expected no change if doing `+ MonthEnd()` to last day of the month but that isn't the case
pd.date_range('2021-02', '2021-05', freq='M') + MonthEnd()

DatetimeIndex(['2021-03-31', '2021-04-30', '2021-05-31'], dtype='datetime64[ns]', freq=None)

In [127]:
pd.date_range('2021-02', '2021-02', freq='MS').values

array(['2021-02-01T00:00:00.000000000'], dtype='datetime64[ns]')

`+ pd.offsets.MonthEnd(n=0) - pd.offsets.MonthBegin(n=1)` seems to get us back to the beginning of the month

`MonthBegin` and `MonthEnd` behave oddly when it is the first/last day of the month

In [160]:
pd.date_range('2021-02', '2021-05', freq='MS') + pd.offsets.MonthEnd(n=0) - pd.offsets.MonthBegin(n=1)

DatetimeIndex(['2021-02-01', '2021-03-01', '2021-04-01', '2021-05-01'], dtype='datetime64[ns]', freq=None)

In [161]:
pd.date_range('2021-02', '2021-05', freq='M') + pd.offsets.MonthEnd(n=0) - pd.offsets.MonthBegin(n=1)

DatetimeIndex(['2021-02-01', '2021-03-01', '2021-04-01'], dtype='datetime64[ns]', freq=None)

however, `rollback` and `rollforward`, below, seem to work as expected

---

In [138]:
pd.date_range('2021-02', '2021-05', freq='MS') + Day()

DatetimeIndex(['2021-02-02', '2021-03-02', '2021-04-02', '2021-05-02'], dtype='datetime64[ns]', freq=None)

In [139]:
pd.date_range('2021-02', '2021-05', freq='MS') + Day(2)

DatetimeIndex(['2021-02-03', '2021-03-03', '2021-04-03', '2021-05-03'], dtype='datetime64[ns]', freq=None)

### `rollforward()` & `rollback()`

In [140]:
from helpsk import date
import datetime

In [141]:
MonthBegin().rollback(parse('2021-01-01'))

Timestamp('2021-01-01 00:00:00')

In [142]:
MonthBegin().rollback(parse('2021-01-31'))

Timestamp('2021-01-01 00:00:00')

In [143]:
MonthEnd().rollforward(date.ymd('2021-01-01'))

Timestamp('2021-01-31 00:00:00')

In [144]:
MonthEnd().rollforward(date.ymd('2021-01-31'))

Timestamp('2021-01-31 00:00:00')

---

In [145]:
# default value for startingMonth doesn't make sense
QuarterBegin().rollback(date.ymd('2021-01-01'))

Timestamp('2020-12-01 00:00:00')

---

### Fiscal Quarter with `QuarterBegin(startingMonth=2)`

In [146]:
dates = np.append(pd.date_range('2021-01', '2021-12-31', freq='MS').values,
                  pd.date_range('2021-01', '2021-12-31', freq='M').values)
dates.sort()
dates

array(['2021-01-01T00:00:00.000000000', '2021-01-31T00:00:00.000000000',
       '2021-02-01T00:00:00.000000000', '2021-02-28T00:00:00.000000000',
       '2021-03-01T00:00:00.000000000', '2021-03-31T00:00:00.000000000',
       '2021-04-01T00:00:00.000000000', '2021-04-30T00:00:00.000000000',
       '2021-05-01T00:00:00.000000000', '2021-05-31T00:00:00.000000000',
       '2021-06-01T00:00:00.000000000', '2021-06-30T00:00:00.000000000',
       '2021-07-01T00:00:00.000000000', '2021-07-31T00:00:00.000000000',
       '2021-08-01T00:00:00.000000000', '2021-08-31T00:00:00.000000000',
       '2021-09-01T00:00:00.000000000', '2021-09-30T00:00:00.000000000',
       '2021-10-01T00:00:00.000000000', '2021-10-31T00:00:00.000000000',
       '2021-11-01T00:00:00.000000000', '2021-11-30T00:00:00.000000000',
       '2021-12-01T00:00:00.000000000', '2021-12-31T00:00:00.000000000'],
      dtype='datetime64[ns]')

In [147]:
[(date.to_string(pd.to_datetime(str(x))),
  QuarterBegin(startingMonth=1).rollback(x)) for x in dates]

[('2021-01-01', Timestamp('2021-01-01 00:00:00')),
 ('2021-01-31', Timestamp('2021-01-01 00:00:00')),
 ('2021-02-01', Timestamp('2021-01-01 00:00:00')),
 ('2021-02-28', Timestamp('2021-01-01 00:00:00')),
 ('2021-03-01', Timestamp('2021-01-01 00:00:00')),
 ('2021-03-31', Timestamp('2021-01-01 00:00:00')),
 ('2021-04-01', Timestamp('2021-04-01 00:00:00')),
 ('2021-04-30', Timestamp('2021-04-01 00:00:00')),
 ('2021-05-01', Timestamp('2021-04-01 00:00:00')),
 ('2021-05-31', Timestamp('2021-04-01 00:00:00')),
 ('2021-06-01', Timestamp('2021-04-01 00:00:00')),
 ('2021-06-30', Timestamp('2021-04-01 00:00:00')),
 ('2021-07-01', Timestamp('2021-07-01 00:00:00')),
 ('2021-07-31', Timestamp('2021-07-01 00:00:00')),
 ('2021-08-01', Timestamp('2021-07-01 00:00:00')),
 ('2021-08-31', Timestamp('2021-07-01 00:00:00')),
 ('2021-09-01', Timestamp('2021-07-01 00:00:00')),
 ('2021-09-30', Timestamp('2021-07-01 00:00:00')),
 ('2021-10-01', Timestamp('2021-10-01 00:00:00')),
 ('2021-10-31', Timestamp('2021-10-01 00:00:00')),
 ('2021-11-01', Timestamp('2021-10-01 00:00:00')),
 ('2021-11-30', Timestamp('2021-10-01 00:00:00')),
 ('2021-12-01', Timestamp('2021-10-01 00:00:00')),
 ('2021-12-31', Timestamp('2021-10-01 00:00:00'))]

In [148]:
[(date.to_string(pd.to_datetime(str(x))),
  QuarterBegin(startingMonth=2).rollback(x)) for x in dates]

[('2021-01-01', Timestamp('2020-11-01 00:00:00')),
 ('2021-01-31', Timestamp('2020-11-01 00:00:00')),
 ('2021-02-01', Timestamp('2021-02-01 00:00:00')),
 ('2021-02-28', Timestamp('2021-02-01 00:00:00')),
 ('2021-03-01', Timestamp('2021-02-01 00:00:00')),
 ('2021-03-31', Timestamp('2021-02-01 00:00:00')),
 ('2021-04-01', Timestamp('2021-02-01 00:00:00')),
 ('2021-04-30', Timestamp('2021-02-01 00:00:00')),
 ('2021-05-01', Timestamp('2021-05-01 00:00:00')),
 ('2021-05-31', Timestamp('2021-05-01 00:00:00')),
 ('2021-06-01', Timestamp('2021-05-01 00:00:00')),
 ('2021-06-30', Timestamp('2021-05-01 00:00:00')),
 ('2021-07-01', Timestamp('2021-05-01 00:00:00')),
 ('2021-07-31', Timestamp('2021-05-01 00:00:00')),
 ('2021-08-01', Timestamp('2021-08-01 00:00:00')),
 ('2021-08-31', Timestamp('2021-08-01 00:00:00')),
 ('2021-09-01', Timestamp('2021-08-01 00:00:00')),
 ('2021-09-30', Timestamp('2021-08-01 00:00:00')),
 ('2021-10-01', Timestamp('2021-08-01 00:00:00')),
 ('2021-10-31', Timestamp('2021-08-01 00:00:00')),
 ('2021-11-01', Timestamp('2021-11-01 00:00:00')),
 ('2021-11-30', Timestamp('2021-11-01 00:00:00')),
 ('2021-12-01', Timestamp('2021-11-01 00:00:00')),
 ('2021-12-31', Timestamp('2021-11-01 00:00:00'))]

### `groupby()` & `rollback()`

In [149]:
dates = pd.date_range('2021-01-01', '2021-12-31')
dates

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10',
               ...
               '2021-12-22', '2021-12-23', '2021-12-24', '2021-12-25',
               '2021-12-26', '2021-12-27', '2021-12-28', '2021-12-29',
               '2021-12-30', '2021-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [150]:
df = pd.DataFrame({'value': range(0, len(dates))}, index=dates)
df

            value
2021-01-01      0
2021-01-02      1
2021-01-03      2
2021-01-04      3
2021-01-05      4
...           ...
2021-12-27    360
2021-12-28    361
2021-12-29    362
2021-12-30    363
2021-12-31    364

[365 rows x 1 columns]

In [168]:
from pandas.tseries.offsets import QuarterBegin

In [169]:
df = pd.DataFrame({'date': dates, 'value': range(0, len(dates))})
df

          date  value
0   2021-01-01      0
1   2021-01-02      1
2   2021-01-03      2
3   2021-01-04      3
4   2021-01-05      4
..         ...    ...
360 2021-12-27    360
361 2021-12-28    361
362 2021-12-29    362
363 2021-12-30    363
364 2021-12-31    364

[365 rows x 2 columns]

In [172]:
df['quarter_start'] = df.date.apply(QuarterBegin(startingMonth=1).rollback)
df

          date  value quarter_start
0   2021-01-01      0    2021-01-01
1   2021-01-02      1    2021-01-01
2   2021-01-03      2    2021-01-01
3   2021-01-04      3    2021-01-01
4   2021-01-05      4    2021-01-01
..         ...    ...           ...
360 2021-12-27    360    2021-10-01
361 2021-12-28    361    2021-10-01
362 2021-12-29    362    2021-10-01
363 2021-12-30    363    2021-10-01
364 2021-12-31    364    2021-10-01

[365 rows x 3 columns]

In [173]:
df.groupby('quarter_start').agg({'value': [min, max, len]})

              value
                min  max len
quarter_start
2021-01-01        0   89  90
2021-04-01       90  180  91
2021-07-01      181  272  92
2021-10-01      273  364  92

Passing in `QuarterBegin(startingMonth=1).rollback` directly doesn't seem to work as I would have thought; I would have guessed it was the same as above.

In [175]:
df.groupby(QuarterBegin(startingMonth=1).rollback).agg({'value': [min, max, len]})

                              value
                                min  max len
1970-01-01 00:00:00.000000000     0    0   1
1970-01-01 00:00:00.000000001     1    1   1
1970-01-01 00:00:00.000000002     2    2   1
1970-01-01 00:00:00.000000003     3    3   1
1970-01-01 00:00:00.000000004     4    4   1
...                             ...  ...  ..
1970-01-01 00:00:00.000000360   360  360   1
1970-01-01 00:00:00.000000361   361  361   1
1970-01-01 00:00:00.000000362   362  362   1
1970-01-01 00:00:00.000000363   363  363   1
1970-01-01 00:00:00.000000364   364  364   1

[365 rows x 3 columns]

# Unexpected Behavior

## Default Arguments

Python’s default arguments are evaluated once when the function is defined, not each time the function is called (like it is in say, Ruby). This means that if you use a mutable default argument and mutate it, you will and have mutated that object for all future calls to the function as well.
	* http://docs.python-guide.org/en/latest/writing/gotchas/
	* This means you cannot assign objects as default arguments

## Operations in general exclude missing data.

https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#stats

In [156]:
df = pd.DataFrame(np.random.randn(6, 4),
                  columns=list("ABCD"))
df.iat[0, 0] = np.nan
df

          A         B         C         D
0       NaN  2.871469  2.184371  0.194326
1  0.301330 -0.546467 -1.098570 -0.768290
2 -1.062999  2.656968  1.372673  1.340727
3 -0.775027  2.547829 -0.647637 -0.100684
4  1.299102  0.920292 -1.583688  0.972841
5  1.102798  0.968852 -0.435754 -0.001409

In [157]:
df.mean()  # this works; R equivalent would have returned `NA`

A    0.173041
B    1.569824
C   -0.034768
D    0.272918
dtype: float64

In [158]:
df.mean(skipna=False)  # have to manually set skipna=False to get desired behavior

A         NaN
B    1.569824
C   -0.034768
D    0.272918
dtype: float64

---